Project/Toir/src/Documents/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ОстановочныеРемонты</name>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ОстановочныеРемонты</basedOn>
  <registerRecords>InformationRegister.торо_ОстановочныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_ЗаявкиПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>IDОсновногоРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийДокументаОстановочныйРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРемонтаСт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонтаСт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Сводный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонтаСтарая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтаСтарая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Отвязать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ОписаниеРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Статус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланРаботПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ЕВОБланк</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ВидыОперацийДокументаОстановочныйРемонт/торо_ВидыОперацийДокументаОстановочныйРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийДокументаОстановочныйРемонт</name>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>ОстановочныйРемонт</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ВидыРемонтов/торо_ВидыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыРемонтов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОбслуживанияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланГрафикППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикМероприятий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непериодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ТипРабот</name>
    <type>
      <types>EnumRef.гкс_ТипыРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Documents/торо_ОстановочныеРемонты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") Тогда
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Свойство("ID") Тогда
		
		Строки = Объект.СвязанныеРемонты.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.СвязанныеРемонты.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		ИначеЕсли Параметры.ID = Объект.IDОсновногоРемонта Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.ДокументОснование;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КорректируемыйДокумент) И ТипЗнч(Объект.КорректируемыйДокумент) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
		Объект.ДокументОснование = Объект.КорректируемыйДокумент.ДокументОснование;
	КонецЕсли; 
	
	//торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(РеквизитФормыВЗначение("Объект"), ЭтаФорма, Строка(Объект.ВидОперации));
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, Строка(Объект.ВидОперации));
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));
	
	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ОстановочныеРемонты;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --
	
	УстановитьУсловноеОформление();
	
	ОбновитьДоступностьДляРедактирования();
	
	УправлениеВидимостью(ЭтотОбъект);
	
	ДиаграммаРемонтов.ОтображатьЗаголовок = Ложь;
	ДиаграммаРемонтов.ОтображатьЛегенду   = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроставитьПризнакЗависимыйПодчиненный();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	УстановитьВидимостьДоступность();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийДокументаОстановочныйРемонт.ОстановочныйРемонт") И ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.IDОсновногоРемонта = "" Тогда
		ПодключитьОбработчикОжидания("ОткрытьФормуДляПодбораОстановочногоРемонта", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, Строка(Объект.ВидОперации));
	Для Каждого СвязанныйРемонт Из Объект.СвязанныеРемонты Цикл
		СвязанныйРемонт.Добавлен = Ложь;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроставитьПризнакЗависимыйПодчиненный();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "ЗагрузкаИзПроджект" Тогда
		Если Параметр = Объект.Ссылка Тогда
			ЭтаФорма.Прочитать();
		КонецЕсли;
	КонецЕсли;
	
	// Согласование++
	Если ИмяСобытия = "УтверждениеСтатусаСогласования" Тогда
		Если Параметр.Документ = Объект.Ссылка Тогда
			ЗавершитьУтверждениеСтатусаДокумента(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Согласование--
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ТекстВопроса = НСтр("es='Todos los datos de la reparación escogida serán limpiados. ¿Continuar?';ru='Все данные по выбранному ремонту будут очищены. Продолжить?';en='All data on the selected repair will be cleared. Continue?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ДокументОснованиеОчисткаЗавершение", ЭтотОбъект, Новый Структура("ВыбиратьНовый, СтароеОснование", Истина, Объект.ДокументОснование)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОткрытьФормуДляПодбораОстановочногоРемонта();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	Параметры = Новый Структура("ПолнотекстовыйПоиск, Отбор", ПолнотекстовыйПоискПриВводеПоСтроке.НеИспользовать, Новый Структура("Истина", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.ДокументОснование = ВыбранноеЗначение.ДокументОснование;
	Объект.IDОсновногоРемонта = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
	Объект.ОбъектРемонта = ВыбранноеЗначение.СтрокаРемонтовОборудования.ОбъектРемонта;
	Объект.ВидРемонта = ВыбранноеЗначение.СтрокаРемонтовОборудования.ВидРемонтныхРабот;
	Объект.ДатаНачалаРемонта = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаНачала;
	Объект.ДатаОкончанияРемонта = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаОкончания;
	Объект.ДатаНачалаРемонтаСт = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаНачала;
	Объект.ДатаОкончанияРемонтаСт = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаОкончания;
	ОбновитьДоступностьДляРедактирования();
	УстановитьВидимостьДоступность();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьДокументСРемонтом(Объект.ДокументОснование, Объект.IDОсновногоРемонта);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ТекстВопроса = НСтр("es='Todos los datos de la reparación escogida serán limpiados. ¿Continuar?';ru='Все данные по выбранному ремонту будут очищены. Продолжить?';en='All data on the selected repair will be cleared. Continue?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ДокументОснованиеОчисткаЗавершение", ЭтотОбъект, Новый Структура("ВыбиратьНовый", Ложь)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчисткаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбиратьНовый = ДополнительныеПараметры.ВыбиратьНовый;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Не ВыбиратьНовый Тогда
			Объект.ДокументОснование = Неопределено;
		КонецЕсли;
		Объект.ОбъектРемонта = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
		Объект.ВидРемонта = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
		Объект.ДатаНачалаРемонта = Дата(1,1,1);
		Объект.ДатаОкончанияРемонта = Дата(1,1,1);
		Объект.IDОсновногоРемонта = "";
		Объект.СвязанныеРемонты.Очистить();
		
		Если ВыбиратьНовый Тогда
			ОткрытьФормуДляПодбораОстановочногоРемонта();
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаРемонтаПриИзменении(Элемент)
	
	Если Объект.ДатаНачалаРемонта > Объект.ДатаОкончанияРемонта Тогда
		ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación es más grande que la fecha de la terminación!';ru='Дата начала ремонта больше даты окончания!';en='Repair start date is greater than the end date!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияРемонтаПриИзменении(Элемент)
	
	Если Объект.ДатаНачалаРемонта > Объект.ДатаОкончанияРемонта Тогда
		ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación es más grande que la fecha de la terminación!';ru='Дата начала ремонта больше даты окончания!';en='Repair start date is greater than the end date!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязанныеРемонты

&НаКлиенте
Процедура СвязанныеРемонтыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для каждого ЭлементМассива из ВыбранноеЗначение Цикл
			СвязанныеРемонтыДобавитьСтроку(ЭлементМассива);
		КонецЦикла;
	Иначе
		СвязанныеРемонтыДобавитьСтроку(ВыбранноеЗначение);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРемонтыДобавитьСтроку(ВыбранноеЗначение)
	
	Если Объект.СвязанныеРемонты.НайтиСтроки(Новый Структура("ID",ВыбранноеЗначение.СтрокаРемонтовОборудования.ID)).Количество() = 0 
		И ВыбранноеЗначение.СтрокаРемонтовОборудования.ID <> Объект.IDОсновногоРемонта Тогда
		
		ДатаНачалаВыбранного = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаНачала;
		ДатаОкончанияВыбранного = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаОкончания;
		
        НС                           = Объект.СвязанныеРемонты.Добавить();
        НС.ID                        = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
        НС.ОбъектРемонта             = ВыбранноеЗначение.СтрокаРемонтовОборудования.ОбъектРемонта;
        НС.ВидРемонта                = ВыбранноеЗначение.СтрокаРемонтовОборудования.ВидРемонтныхРабот;
        НС.ДатаНачалаРемонта         = ДатаНачалаВыбранного;
        НС.ДатаОкончанияРемонта      = ДатаОкончанияВыбранного;
        НС.ДатаНачалаРемонтаСтарая   = ДатаНачалаВыбранного;
        НС.ДатаОкончанияРемонтаСтарая= ДатаОкончанияВыбранного;
        НС.ДокументИсточник          = ВыбранноеЗначение.ДокументОснование;
        НС.Добавлен                  = Истина;
        НС.Зависимый                 = ВыбранноеЗначение.СтрокаРемонтовОборудования.Зависимый;
        НС.Подчиненный               = ВыбранноеЗначение.СтрокаРемонтовОборудования.Подчиненный;
        НС.Исполнитель               = ВыбранноеЗначение.СтрокаРемонтовОборудования.Исполнитель;
        НС.СпособВыполнения          = ВыбранноеЗначение.СтрокаРемонтовОборудования.СпособВыполнения;
        НС.КритичностьДефекта        = ВыбранноеЗначение.СтрокаРемонтовОборудования.КритичностьДефекта;

		НС.Добавлен                  = Истина;
		
		Если Объект.ДатаНачалаРемонта > ДатаНачалаВыбранного Или Объект.ДатаОкончанияРемонта < ДатаОкончанияВыбранного Тогда
			ТекстСообщения = НСтр("es='¡La reparación escogida sale por las fronteras del intervalo de la reparación básica!';ru='Выбранный ремонт выходит за границы интервала основного ремонта!';en='The selected repair is outside the basic repair interval!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		ОбновитьДоступностьДляРедактирования();
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРемонтыПередНачаломИзменения(Элемент, Отказ)
	ДанныеСтроки = Элемент.ТекущиеДанные;
	МассивСтрок = МассивДоступныхДляКорректировкиСтрок.НайтиСтроки(Новый Структура("ID", ДанныеСтроки.ID));
	Если МассивСтрок.Количество() > 0 Тогда
		
		СтрокаДляРедактирования = Массивстрок[0];
		Если Не СтрокаДляРедактирования = Неопределено И Не СтрокаДляРедактирования.ДоступенДляРедактирования Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ((НоваяСтрока И ОтменаРедактирования) Или ТекДанные = Неопределено) Тогда
		Если ЗначениеЗаполнено(ТекДанные.ДатаНачалаРемонта) И ЗначениеЗаполнено(ТекДанные.ДатаОкончанияРемонта) Тогда
			НачалоВыходитЗаГраницы = ТекДанные.ДатаНачалаРемонта < Объект.ДатаНачалаРемонта;
			ОкончаниеВыходитЗаГраницы = ТекДанные.ДатаОкончанияРемонта > Объект.ДатаОкончанияРемонта;
			Если НачалоВыходитЗаГраницы Или ОкончаниеВыходитЗаГраницы Тогда
				ТекстВопроса = НСтр("es='¡Las fronteras del período de la reparación redactada salen! A mover por las fronteras del período de la reparación de parada de la frontera del período:';ru='Границы периода редактируемого ремонта выходят за границы периода остановочного ремонта! Сдвинуть границы периода:';en='The boundaries of the editable repair period go beyond the boundaries of the stop repair period! Move period boundaries:'");
				ВариантыДействий = Новый СписокЗначений;
                ВариантыДействий.Добавить("СдвинутьВШапке"         , НСтр("es='De la reparación de parada';ru='Остановочного ремонта';en='Stopl repair'"));
                ВариантыДействий.Добавить("СдвинутьУТекущего"      , НСтр("es='Redactado';ru='Редактируемого';en='Editable'"));
                ВариантыДействий.Добавить(КодВозвратаДиалога.Отмена, НСтр("es='De nada emprender';ru='Ничего не предпринимать';en='Do nothing'"));
				
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросОСдвигеДат", ЭтотОбъект, Новый Структура("ТекДанные, Начало, Окончание", ТекДанные, НачалоВыходитЗаГраницы, ОкончаниеВыходитЗаГраницы)), ТекстВопроса, ВариантыДействий);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "СвязанныеРемонтыОтвязать" И Поле.Имя <> "СвязанныеРемонтыДатаНачалаРемонта" И Поле.Имя <> "СвязанныеРемонтыДатаОкончанияРемонта" Тогда
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		ОткрытьДокументСРемонтом(ДанныеСтроки.ДокументИсточник, ДанныеСтроки.ID);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРемонтыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ЭтоКорректировка = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка");
	
	Для Каждого ВыдСтрока Из Элемент.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыдСтрока);
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ID) 
			ИЛИ ДанныеСтроки.Добавлен Тогда
			Объект.СвязанныеРемонты.Удалить(ДанныеСтроки);
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = МассивДоступныхДляКорректировкиСтрок.НайтиСтроки(Новый Структура("ID", ДанныеСтроки.ID));
		
		Если НайденныеСтроки.Количество() > 0 
			И НайденныеСтроки[0].ДоступенДляРедактирования 
			И Не ЭтоКорректировка Тогда
			
			Объект.СвязанныеРемонты.Удалить(ДанныеСтроки);
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФормуДляПодбораЗависимыхРемонтов();
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьСтатус(Команда)
	
	торо_РаботаССогласованиямиКлиент.УстановитьСтатус(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументРемонта(Команда)
	
	Для Каждого ВыдСтрока Из Элементы.СвязанныеРемонты.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.СвязанныеРемонты.ДанныеСтроки(ВыдСтрока);
		ОткрытьДокументСРемонтом(ДанныеСтроки.ДокументИсточник, ДанныеСтроки.ID);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьГраницы(Команда)
	
	Если Команда.Имя = "СдвинутьГраницыОсновного" Тогда
        Обработчик   = "ОбработатьВыборВариантаСдвигаГраницОсновногоРемонта";
        ТекстВопроса = НСтр("es='Escojan la variante del desplazamiento de las fronteras de la reparación básica';ru='Выберите вариант смещения границ основного ремонта';en='Choose the option of shifting the boundaries of the main repair'");
	Иначе
		Обработчик   = "ОбработатьВыборВариантаСдвигаГраницСвязанныхРемонтов";
		ТекстВопроса = НСтр("es='Escojan la variante del desplazamiento de las fronteras de las reparaciones vinculadas';ru='Выберите вариант смещения границ связанных ремонтов';en='Select an option to offset the bounds of related repairs.'");
	КонецЕсли; 
	
	ОписаниеОповещения = Новый ОписаниеОповещения(Обработчик, ЭтаФорма);
	
	СписокВариантовСмещения = Новый СписокЗначений;
    СписокВариантовСмещения.Добавить(1                        , НСтр("es='Mover la fecha del comienzo';ru='Сдвинуть дату начала';en='Move start date'"));
    СписокВариантовСмещения.Добавить(2                        , НСтр("es='Mover las dos fechas';ru='Сдвинуть обе даты';en='Move both dates'"));
    СписокВариантовСмещения.Добавить(3                        , НСтр("es='Mover la fecha de la terminación';ru='Сдвинуть дату окончания';en='Move end date'"));    
    СписокВариантовСмещения.Добавить(КодВозвратаДиалога.Отмена, НСтр("es='De nada emprender';ru='Ничего не предпринимать';en='Do nothing'"));    

	//
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокВариантовСмещения,,, НСтр("es='Mover las fronteras';ru='Сдвинуть границы';en='Push borders'"),);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьОбновить(Команда)
	ПостроитьОбновитьДиаграммуГанта();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	Для каждого ТочкаДиаграммыГанта Из ДиаграммаРемонтов.Точки Цикл
		ДиаграммаРемонтов.СвернутьТочку(ТочкаДиаграммыГанта, Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	Для каждого ТочкаДиаграммыГанта Из ДиаграммаРемонтов.Точки Цикл
		ДиаграммаРемонтов.РазвернутьТочку(ТочкаДиаграммыГанта, Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказательЛегенду(Команда)
	Элементы.ПоказатьЛегенду.Пометка = НЕ Элементы.ПоказатьЛегенду.Пометка;
	Элементы.ЛегендаДиаграммы.Видимость = Элементы.ПоказатьЛегенду.Пометка;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ВопросОСдвигеДат(Ответ, ДополнительныеПараметры) Экспорт 
	
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	НачалоВыходитЗаГраницы = ДополнительныеПараметры.Начало;
	ОкончаниеВыходитЗаГраницы = ДополнительныеПараметры.Окончание;
	
	Если Ответ = "СдвинутьВШапке" Тогда
		Если НачалоВыходитЗаГраницы Тогда
			Объект.ДатаНачалаРемонта = ТекДанные.ДатаНачалаРемонта;
		КонецЕсли;
		Если ОкончаниеВыходитЗаГраницы Тогда
			Объект.ДатаОкончанияРемонта = ТекДанные.ДатаОкончанияРемонта;
		КонецЕсли;
	ИначеЕсли Ответ = "СдвинутьУТекущего" Тогда
		Если НачалоВыходитЗаГраницы Тогда
			ТекДанные.ДатаНачалаРемонта = Объект.ДатаНачалаРемонта;
			Если ТекДанные.ДатаОкончанияРемонта < ТекДанные.ДатаНачалаРемонта Тогда
				ТекДанные.ДатаОкончанияРемонта = ТекДанные.ДатаНачалаРемонта;
			КонецЕсли;
		КонецЕсли;
		Если ОкончаниеВыходитЗаГраницы Тогда
			ТекДанные.ДатаОкончанияРемонта = Объект.ДатаОкончанияРемонта;
			Если ТекДанные.ДатаОкончанияРемонта < ТекДанные.ДатаНачалаРемонта Тогда
				ТекДанные.ДатаНачалаРемонта = ТекДанные.ДатаОкончанияРемонта;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументСРемонтом(Документ, ID)
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
		ОткрытьФорму("Документ.торо_ПланГрафикРемонта.ФормаОбъекта", Новый Структура("Ключ, ID", Документ, ID), ЭтаФорма);
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		ОткрытьФорму("Документ.торо_ЗаявкаНаРемонт.ФормаОбъекта", Новый Структура("Ключ, ID", Документ, ID), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДляПодбораОстановочногоРемонта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
	ПараметрыФормы.Вставить("ВладелецДата", Объект.Дата);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Заголовок", НСтр("es='La selección de la reparación de parada';ru='Подбор остановочного ремонта';en='Stop repair selection'"));
	ПараметрыФормы.Вставить("IDОстановочного", Объект.IDОсновногоРемонта);
	ПараметрыФормы.Вставить("ОР", Объект.ОбъектРемонта);
	ПараметрыФормы.Вставить("ВР", Объект.ВидРемонта);
	
	ДокументыОснования = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ДокументыОснования.Добавить(Объект.ДокументОснование);
	КонецЕсли;
	
	Для Каждого Ремонт Из Объект.СвязанныеРемонты Цикл
		Если ДокументыОснования.НайтиПоЗначению(Ремонт.ДокументИсточник) = Неопределено Тогда
			ДокументыОснования.Добавить(Ремонт.ДокументИсточник);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ДокументыОснования", ДокументыОснования);
	
	ОткрытьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ПодборРемонтовОборудованияИРемонтныхРабот",
				ПараметрыФормы, Элементы.ДокументОснование, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДляПодбораЗависимыхРемонтов()
		
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ЗначениеЗаполнено(Объект.ОбъектРемонта) Тогда
		
		ПараметрыФормы = Новый Структура;
        ПараметрыФормы.Вставить("Владелец"             , Объект.Ссылка);
        ПараметрыФормы.Вставить("ДокументИсточник"     , Объект.Ссылка);

        ПараметрыФормы.Вставить("ВладелецДата"         , Объект.Дата);
        ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"   , Ложь);
        ПараметрыФормы.Вставить("Заголовок"            , НСтр("es='La selección de las reparaciones dependientes';ru='Подбор зависимых ремонтов';en='Selection of dependent repairs'"));
        ПараметрыФормы.Вставить("IDОстановочного"      , Объект.IDОсновногоРемонта);
        ПараметрыФормы.Вставить("ОР"                   , Объект.ОбъектРемонта);
        ПараметрыФормы.Вставить("ВР"                   , Объект.ВидРемонта);
        ПараметрыФормы.Вставить("ДатаНачалаРемонта"    , Объект.ДатаНачалаРемонта);
        ПараметрыФормы.Вставить("ДатаОкончанияРемонта" , Объект.ДатаОкончанияРемонта);
		
		
		ДокументыОснования = Новый СписокЗначений;
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			ДокументыОснования.Добавить(Объект.ДокументОснование);
		КонецЕсли;
		Для Каждого Ремонт Из Объект.СвязанныеРемонты Цикл
			Если ДокументыОснования.НайтиПоЗначению(Ремонт.ДокументИсточник) = Неопределено Тогда
				ДокументыОснования.Добавить(Ремонт.ДокументИсточник);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыФормы.Вставить("ДокументыОснования", ДокументыОснования);
		
		ОткрытьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ФормаПодбораПоОстановочнымРемонтам",
			ПараметрыФормы, Элементы.СвязанныеРемонты, ЭтаФорма, ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	Иначе
		ТекстСообщения = НСтр("es='la reparación de parada!';ru='Не выбран остановочный ремонт!';en='Stop repair not selected!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ДокументОснование","Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	ВидОперацииКорректировка = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка");
	
	Элементы.КорректируемыйДокумент.Видимость = ВидОперацииКорректировка;
	Элементы.СвязанныеРемонтыОтвязать.Видимость = ВидОперацииКорректировка;
	Элементы.Шапка.ТолькоПросмотр = ВидОперацииКорректировка;
	ТолькоПросмотрДатОсновного = Ложь;
	МассивСтрок = МассивДоступныхДляКорректировкиСтрок.НайтиСтроки(Новый Структура("ID", Объект.IDОсновногоРемонта));
	Если МассивСтрок.Количество() > 0 Тогда
		
		СтрокаДляРедактирования = Массивстрок[0];
		Если Не СтрокаДляРедактирования = Неопределено И Не СтрокаДляРедактирования.ДоступенДляРедактирования Тогда
			 ТолькоПросмотрДатОсновного = Истина;
		КонецЕсли;
		 
	КонецЕсли;
	 
	Элементы.ДатаНачалаИДатаОкончанияРемонта.ТолькоПросмотр = ТолькоПросмотрДатОсновного;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДляРедактирования()
	
	МассивДоступныхДляКорректировкиСтрок.Очистить();
	МассивДоступныхДляКорректировкиСтрок.Загрузить(Документы.торо_ОстановочныеРемонты.ОбновитьДоступностьДляРедактирования(Объект.Ссылка, ПолучитьТаблицуРемонтовСОсновным()));
	
	МассивСтрок = МассивДоступныхДляКорректировкиСтрок.НайтиСтроки(Новый Структура("ID", Объект.IDОсновногоРемонта));
	Если МассивСтрок.Количество() > 0 Тогда
		
		СтрокаДляРедактирования = Массивстрок[0];
		Если Не СтрокаДляРедактирования = Неопределено И Не СтрокаДляРедактирования.ДоступенДляРедактирования Тогда
			ТолькоПросмотрДатОсновного = Истина;
		Иначе
			 ТолькоПросмотрДатОсновного = Ложь;
		КонецЕсли;
		 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуРемонтовСОсновным()
	
	ТаблицаРемонтовСОсновным = Объект.СвязанныеРемонты.Выгрузить();
	НС = ТаблицаРемонтовСОсновным.Добавить();
    НС.ID                         = Объект.IDОсновногоРемонта;
    НС.ОбъектРемонта              = Объект.ОбъектРемонта;
    НС.ВидРемонта                 = Объект.ВидРемонта;
    НС.ДатаНачалаРемонта          = Объект.ДатаНачалаРемонта;
    НС.ДатаОкончанияРемонта       = Объект.ДатаОкончанияРемонта;
    НС.ДатаНачалаРемонтаСтарая    = Объект.ДатаНачалаРемонтаСт;
    НС.ДатаОкончанияРемонтаСтарая = Объект.ДатаОкончанияРемонтаСт;
    НС.ДокументИсточник           = Объект.ДокументОснование;
	
	Возврат ТаблицаРемонтовСОсновным;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(ДокОбъект)
	Элементы = ДокОбъект.Элементы;
	Объект = ДокОбъект.Объект;
	Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(Объект.СпособСогласования);
КонецПроцедуры

#Область Согласование

&НаСервере
Процедура ЗавершитьУтверждениеСтатусаДокумента(ПараметрыОповещения)
	
	торо_РаботаССогласованиями.ЗавершитьУтверждениеСтатусаДокумента(ЭтаФорма, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСогласующих(НовыйСпособСогласования = Ложь) 
	
	торо_РаботаССогласованиями.ОбновитьДеревоСогласующих(ЭтаФорма, НовыйСпособСогласования);
		
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияПриИзменении(Элемент)
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияОчистка(Элемент, СтандартнаяОбработка)
	Если Элемент.Значение = ПредопределенноеЗначение("Справочник.торо_СпособыСогласованияДокументов.ПустаяСсылка") Тогда
		фПослеОчистки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если СогласующиеРегистр.Количество() > 0 Тогда
					
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент",Элемент)),
						НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет);
								
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_РаботаССогласованиямиКлиент.ОткрытьЗаписьИсторииСтатусов(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// Согласование++
   Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСтатусДокумента.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//
   	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСогласующий.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//
   	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияЗамещающий.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 2;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Согласование--
	
	
	//
   	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СвязанныеРемонты.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СвязанныеРемонты.Изменен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));

КонецПроцедуры

&НаКлиенте 
Процедура ОбработатьВыборВариантаСдвигаГраницОсновногоРемонта(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли; 
	
	ДатаОкончанияРемонта = Объект.ДатаОкончанияРемонта;
	ДатаНачалаРемонта    = Объект.ДатаНачалаРемонта;
	
	Для каждого Строка Из Объект.СвязанныеРемонты Цикл
		ДатаНачалаРемонта    = Мин(ДатаНачалаРемонта, Строка.ДатаНачалаРемонта);
		ДатаОкончанияРемонта = Макс(ДатаОкончанияРемонта, Строка.ДатаОкончанияРемонта);
	КонецЦикла; 
	
	Если Результат = 1 Тогда      //Сдвиг даты начала
		Объект.ДатаНачалаРемонта = ДатаНачалаРемонта;
	ИначеЕсли Результат = 2 Тогда //Обе даты
		Объект.ДатаНачалаРемонта    = ДатаНачалаРемонта;
		Объект.ДатаОкончанияРемонта = ДатаОкончанияРемонта;
	Иначе                         //Дата окончания
		Объект.ДатаОкончанияРемонта = ДатаОкончанияРемонта;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработатьВыборВариантаСдвигаГраницСвязанныхРемонтов(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли; 
	
	ДатаОкончанияРемонта = Объект.ДатаОкончанияРемонта;
	ДатаНачалаРемонта    = Объект.ДатаНачалаРемонта;
	
	Для каждого ИдентификаторСтроки Из Элементы.СвязанныеРемонты.ВыделенныеСтроки Цикл
		
		Строка = Объект.СвязанныеРемонты.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если Не Строка = Неопределено Тогда
			
			Если Результат = 1 Тогда      //Сдвиг даты начала
                Строка.ДатаНачалаРемонта    = Объект.ДатаНачалаРемонта;
            ИначеЕсли Результат = 2 Тогда //Обе даты
                Строка.ДатаНачалаРемонта    = Объект.ДатаНачалаРемонта;
                Строка.ДатаОкончанияРемонта = Объект.ДатаОкончанияРемонта;
            Иначе                         //Дата окончания
                Строка.ДатаОкончанияРемонта = Объект.ДатаОкончанияРемонта;		
			КонецЕсли; 
			
			Строка.Изменен = Истина;

		КонецЕсли; 
	КонецЦикла; 
		
КонецПроцедуры


&НаКлиенте
Процедура ПолосаРегулированияДиаграммыГантаПриИзменении(Элемент)
	
	Если ПолосаРегулированияДиаграммыГанта < 1 Тогда
		ДиаграммаРемонтов.ПоддержкаМасштаба 				= ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	Иначе
		ДиаграммаРемонтов.ПоддержкаМасштаба 				= ПоддержкаМасштабаДиаграммыГанта.Период;
		ДиаграммаРемонтов.ЕдиницаПериодическогоВарианта 	= ТипЕдиницыШкалыВремени["День"];
		ДиаграммаРемонтов.КратностьПериодическогоВарианта 	= ПолосаРегулированияДиаграммыГанта;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ПостроитьОбновитьДиаграммуГанта()
	
	ДатаОкончанияРемонта = Объект.ДатаОкончанияРемонта;
	ДатаНачалаРемонта    = Объект.ДатаНачалаРемонта;
	
	Для каждого Строка Из Объект.СвязанныеРемонты Цикл
		ДатаНачалаРемонта    = Мин(ДатаНачалаРемонта, Строка.ДатаНачалаРемонта);
		ДатаОкончанияРемонта = Макс(ДатаОкончанияРемонта, Строка.ДатаОкончанияРемонта);
	КонецЦикла; 
	
	Если ДатаНачалаРемонта = Дата("00010101")
		ИЛИ ДатаОкончанияРемонта = Дата("00010101") Тогда
		ТекстСообщения = НСтр("es='Comprueben el relleno de las fechas de la reparación básica';ru='Проверьте заполнение дат основного ремонта';en='Check completion date for major repairs'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	ДиаграммаРемонтов.Очистить();
	ДиаграммаРемонтов.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаРемонтов.ОтображатьЛегенду               = Ложь;
	ДиаграммаРемонтов.УстановитьПолныйИнтервал(ДатаНачалаРемонта, ДатаОкончанияРемонта);
	
	СерияРемонт = ДиаграммаРемонтов.Серии.Добавить();
	СерияРемонт.Текст = "Зависимые ремонты";
	
	
	//Шрифты
	ШрифтЖирныйПодчеркнутый = Новый Шрифт(,,Истина, Ложь, Истина);
	ШрифтЖирный             = Новый Шрифт(,,Истина, Ложь, Ложь);
	
	ТочкаОсновнойРемонт = ДиаграммаРемонтов.Точки.Добавить();
	ТочкаОсновнойРемонт.Текст = НСтр("es='La reparación básica';ru='Основной ремонт';en='Basic repair'");
	ТочкаОсновнойРемонт.Шрифт = ШрифтЖирныйПодчеркнутый;	
	
	Значение = ДиаграммаРемонтов.ПолучитьЗначение(ТочкаОсновнойРемонт, СерияРемонт);
	
	Интервал = Значение.Добавить();
	Интервал.Начало = Объект.ДатаНачалаРемонта;
	Интервал.Конец  = КонецДня(Объект.ДатаОкончанияРемонта);
	Интервал.Текст  = Строка(Объект.ДатаНачалаРемонта) + " - " + Строка(Объект.ДатаОкончанияРемонта);
	Интервал.Цвет   = WebЦвета.Бирюзовый;

	
	ТочкаРемонтыОсновногоОборудования = ТочкаОсновнойРемонт.Точки.Добавить();
	ТочкаРемонтыОсновногоОборудования.Текст = НСтр("es='Las reparaciones de la maquinaria básica';ru='Ремонты основного оборудования';en='Repairs of the main equipment'");
	ТочкаРемонтыОсновногоОборудования.Шрифт = ШрифтЖирный;	
	
	ТочкаРемонтыЗависимогоОборудования = ТочкаОсновнойРемонт.Точки.Добавить();
	ТочкаРемонтыЗависимогоОборудования.Текст = НСтр("es='Las reparaciones de la maquinaria dependiente';ru='Ремонты зависимого оборудования';en='Repair of dependent equipment'");
	ТочкаРемонтыЗависимогоОборудования.Шрифт = ШрифтЖирный;	
	
	ТочкаРемонтыПодчиненногоОборудования = ТочкаОсновнойРемонт.Точки.Добавить();
	ТочкаРемонтыПодчиненногоОборудования.Текст = НСтр("es='Las reparaciones de la maquinaria subordinada';ru='Ремонты подчиненного оборудования';en='Repair of slave equipment'");
	ТочкаРемонтыПодчиненногоОборудования.Шрифт = ШрифтЖирный;	
	
	ДобавитьРемонтыВДиаграмму(ТочкаРемонтыОсновногоОборудования   , Новый Структура("Зависимый, Подчиненный", Ложь  , Ложь));
	ДобавитьРемонтыВДиаграмму(ТочкаРемонтыЗависимогоОборудования  , Новый Структура("Зависимый, Подчиненный", Истина, Ложь));
	ДобавитьРемонтыВДиаграмму(ТочкаРемонтыПодчиненногоОборудования, Новый Структура("Зависимый, Подчиненный", Ложь  , Истина));
	
	ДиаграммаРемонтов.РазвернутьТочку(ТочкаОсновнойРемонт, Истина);

КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьРемонтыВДиаграмму(Точка, СтруктураОтбораОтбора)
	
	ТекДата = ТекущаяДата();
	СерияРемонт = ДиаграммаРемонтов.Серии[0];
	
	СтруктураЦветов = Новый Структура("ЦветВыполненого, ЦветЗапланированного");
	СтруктураЦветов.ЦветВыполненого 			= WebЦвета.Черный;
	СтруктураЦветов.ЦветЗапланированного 		= WebЦвета.Васильковый;
	
	МассивСтрок = Объект.СвязанныеРемонты.НайтиСтроки(СтруктураОтбораОтбора);
	
	СоответствиеОР = Новый Соответствие;
	
	Для каждого Строка Из МассивСтрок Цикл
		
		СтруктураДанныхПоОР = СоответствиеОР.Получить(Строка.ОбъектРемонта);
		
		Если СтруктураДанныхПоОР = Неопределено Тогда //Надо добавить точки
			
			ТочкаОР = Точка.Точки.Добавить();
			ТочкаОР.Текст       = Строка.ОбъектРемонта;
			ТочкаОР.Расшифровка = Строка.ОбъектРемонта;
			ТочкаОР.Шрифт       = Новый Шрифт(,,Ложь, Ложь, Истина);
			
			СтруктураДанныхПоОР = Новый Структура();
			СтруктураДанныхПоОР.Вставить("СоответсвиеВР", Новый Соответствие);
			СтруктураДанныхПоОР.Вставить("ТочкаОР"      , ТочкаОР);
			
			СоответствиеОР.Вставить(Строка.ОбъектРемонта, СтруктураДанныхПоОР);
			СтруктураДанныхПоОР = СоответствиеОР.Получить(Строка.ОбъектРемонта);

		КонецЕсли;
		
		ТочкаОР        = СтруктураДанныхПоОР.ТочкаОР;
		СоответствиеВР = СтруктураДанныхПоОР.СоответсвиеВР;
		
		ТочкаВР = СоответствиеВР.Получить(Строка.ВидРемонта);
		
		Если ТочкаВР = Неопределено Тогда
			
			ТочкаВР = ТочкаОР.Точки.Добавить();
			
			ТочкаВР.Текст       = Строка.ВидРемонта;
			ТочкаВР.Расшифровка = Строка.ВидРемонта;
			
			СоответствиеВР.Вставить(Строка.ВидРемонта, ТочкаВР);
			
			ТочкаВР = СоответствиеВР.Получить(Строка.ВидРемонта);
			
		КонецЕсли; 
		
		Значение = ДиаграммаРемонтов.ПолучитьЗначение(ТочкаВР, СерияРемонт);
		
		НайденныеСтроки = МассивДоступныхДляКорректировкиСтрок.НайтиСтроки(Новый Структура("ID", Строка.ID));
		
		Если НайденныеСтроки.Количество() > 0 
			И НайденныеСтроки[0].ДоступенДляРедактирования Тогда
			Значение.Редактирование = Истина;
		КонецЕсли;
	
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачалаРемонта;
		Интервал.Конец  = Строка.ДатаОкончанияРемонта;
		Интервал.Текст  = Строка(Строка.ДатаНачалаРемонта) + " - " + Строка(Строка.ДатаОкончанияРемонта);
		Интервал.Цвет   = ?(Строка.ДатаНачалаРемонта < ТекДата,  СтруктураЦветов.ЦветВыполненого,  СтруктураЦветов.ЦветЗапланированного);

		Расшифровка = Новый Структура("ID", Строка.ID);
		
		Интервал.Расшифровка = Расшифровка;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	
	Если ТипЗнч(Расшифровки) = Тип("Массив") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Для каждого ЭлементМассива Из Расшифровки Цикл
			
			Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
				
				МассивСтрок = Объект.СвязанныеРемонты.НайтиСтроки(Новый Структура("ID", ЭлементМассива.ID));
				
				Если МассивСтрок.Количество() > 0 Тогда
					Элементы.СвязанныеРемонты.ТекущаяСтрока = Объект.СвязанныеРемонты.Индекс(МассивСтрок[0]);
					Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСвязанныеРемонты;
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли; 
	
	//Интервал
	
	ДатаНачала    = Мин(Интервал.Начало, Интервал.Конец);
	ДатаОкончания = Макс(Интервал.Начало, Интервал.Конец);
	
	ID = Интервал.Расшифровка.ID;
	
	МассивСтрок = Объект.СвязанныеРемонты.НайтиСтроки(Новый Структура("ID", ID));
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		Строка = МассивСтрок[0];
		
		Строка.ДатаНачалаРемонта    = ДатаНачала;
		Строка.ДатаОкончанияРемонта = ДатаОкончания;
		Строка.Изменен              = Истина;
		
		Значение = Интервал.Значение;
		
		Для каждого ИнтервалИзЗначения Из Значение Цикл
			Если ИнтервалИзЗначения.Расшифровка.ID = Интервал.Расшифровка.ID Тогда
				
				ИнтервалИзЗначения.Текст  = Строка(Строка.ДатаНачалаРемонта) + " - " + Строка(Строка.ДатаОкончанияРемонта);
				Прервать;
				
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРемонтыДатаНачалаРемонтаПриИзменении(Элемент)
	ПроставитьПризнакИзмененВТекущейСтроке();
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРемонтыДатаОкончанияРемонтаПриИзменении(Элемент)
	ПроставитьПризнакИзмененВТекущейСтроке();
КонецПроцедуры

&НаКлиенте 
Процедура ПроставитьПризнакИзмененВТекущейСтроке()
	ТекущиеДанные = Элементы.СвязанныеРемонты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Изменен = Истина;
	КонецЕсли; 	
КонецПроцедуры

// Процедура - Проставить признак зависимый подчиненный
// см. Документы.торо_ОстановочныеРемонты.ПроставитьПризнакЗависимыйПодчиненный 
&НаСервере
Процедура ПроставитьПризнакЗависимыйПодчиненный()
	Документы.торо_ОстановочныеРемонты.ПроставитьПризнакЗависимыйПодчиненный(Объект.СвязанныеРемонты, Объект.ОбъектРемонта, Объект.ВидРемонта);	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");	
	
КонецПроцедуры
 
фПослеОчистки = Ложь;

#КонецОбласти
